In [1]:
import pandas as pd
data = pd.read_excel('data.xlsx')

In [4]:
name_list = []
date_list = []
#按照顺序获取所有名字和日期
for index , row in data.iterrows():
    if row['Name'] not in name_list:
        name_list.append(row['Name'])
    if row['Date'] not in date_list:
        date_list.append(row['Date'])

In [5]:
#每一个人都要有每一个日期的值，若此日期没有则填充为0，因此提前构建字典，所有值均设置为0，后遍历datarame，对相应的值进行更改
user_dic = {}
every_user_dic_int = {}
for date in date_list:
    every_user_dic_int[date] = 0
for name in name_list:
    user_dic[name] = every_user_dic_int.copy()

In [6]:
for index , row in data.iterrows():
    user_dic[row['Name']][row['Date']] = row['Cost']#若类似于cost的属性较多需要整理则遍历colmnoms.values,目前只有一个Cost属性需要填充，因此此处进行简化

In [10]:
dic = {}
dic['Codenew'] = []
dic['Name'] = []
Current_new_code = 2001
for key in user_dic.keys():
    dic['Codenew'].append(Current_new_code)
    Current_new_code +=1 
    dic['Name'].append(key)
    for date in date_list:
        date_string = date + 'Cost'
        if date_string not in dic:
            dic[date_string] = [user_dic[key][date]]
        else: dic[date_string].append(user_dic[key][date])

In [11]:
result = pd.DataFrame.from_dict(dic)
result

   Codenew   Name  2018Q1Cost  2018Q2Cost  2018Q3Cost  2018Q4Cost
0     2001  Kevin         202         320         159           0
1     2002   Tony         367         147         234         213
2     2003   Mary         402         302           0         289
3     2004   Lucy           0           0         217         110